console.log('number' + 3 + 3);
//number33 - так як 'number' це стрінга, то не відбувається перетворення і цифри конкатенуються до стрінги 

console.log(null + 3);
// 3 - null конвертується в 0 і сумується з 3

console.log(5 && "qwerty");
// qwerty - тут оба значення true, тому воно поветає останнє true значення

console.log(+'40' + +'2' + "hillel");
// 42hillel - знак + біля стрінги перетворює її на цифру, тож 40 та 2 стають цифрами, додаються і так як далі вже стрінга, то до суми 40+2 (42) конкатенується стрінга

console.log('10' - 5 === 6);
// false - спершу відбувається арифметична операція. стрінга 10 перетвориться на число, від неї відніметься 5 і стане 5. і потім вже 5 порівняється з 6

console.log(true + false);
// 1 - відбувається конвертація true до 1 та false до 0 і далі додавання

console.log('4px' - 3);
// Nan - так як тут мінус, то відбувається конвертування данних, але так як в стрінзі є і букви, то дані не можуть бути конвертовані

console.log('4' - 3);
// 1 - із-за мінуса відбувається перетворення стрінги на цифру і потім відбулось віднімання

console.log('6' + 3 ** 0);
// 61 - найперш відбулось возведення 3 у ступінь 0, що дорівнює 1. так як у нас знак +, то перетворення данних немає і 1 конкатенувало до стрінги '6'

console.log(12 / '6');
// 2 - відбулось перетворення стрінги в цифру із-за знаку ділення і потім відбулось ділення

console.log('10' + (5 === 6));
// 10false - найперш відбулось порівняння цифр у дужках. далі із-за того що маємо знак плюса, то не відбулось перетворення данних і false конкатенував до стрінги '10'

console.log(null == '');
// false - null це повна відсутність значень, коли '' - це пуста стрінга. 

console.log(3 ** (9 / 3));
// 27 - найперш відбулось ділення у дужках (стало 3), а потім 3 возвелось у ступінь 3

console.log(!!'false' == !!'true');
// true - тут порівнюються дві стрінги, бо в лапках, тому спочатку воно тру, перший знак оклику змінює на фолс, а другий - знов на тру. тому з двох сторін буде тру, яке після перетворення стають 1
// true == true -> 1 == 1. і результатом буде true

console.log(0 || '0' && 1);
// 1 - спершу порівнюється 0 || '0' і повертає '0' бо воно true, бо || повертає перше правильне. 
// далі порівнюється '0' && 1, тут оба true і тому повертається останнє правильне значенняю (1)

console.log((+null == false) < 1);
// false із-за знаку + біля null - null перетвориться на 0. далі 0 порівняється з false. false також перетвориться на 0 бо у нас не строге порівняння і відбувається перетворення. 
// в результаті ми отримаємо true у скобках. true у порівнянні більше/менше перетворюється на 1, а 1 не менше 1

console.log(false && true || true);
// true. спершу порівнюється false && true і повертає false, бо && повертає перше неправильне якщо воно є. 
// далі порівнює false || true. || повертає перше правильне, тому результат true якщо воно є.

console.log(false && (false || true));
// false - найперш відбувається порівняння у дужках false || true. || повертає перше правильне (якщо воно є), тому у нас повертає true. 
// далі відбувається порівняння false && true.  && повертає перше неправильне (якщо воно є), тому результат false

console.log((+null == false) < 1 ** 5);
// false - спершу то що в дужках. +null трансформується в 0, бо там + перед null. 
// false також перетвориться на 0 бо у нас не строге порівняння і таке рівняння буде true.
//  потім 1 зведеться у ступінь 5, що дорівнює 1. 
// і далі буде рівняння 1 менше 1, що false